scripts/result-analysis/20260422_051015/webflux-io-100-run2.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: io-bound-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 004/100 VUs, 36 complete and 0 interrupted iterations
default   [   0% ] 004/100 VUs  0m00.9s/4m00.0s

running (0m02.0s), 007/100 VUs, 139 complete and 0 interrupted iterations
default   [   1% ] 007/100 VUs  0m02.0s/4m00.0s

running (0m03.0s), 010/100 VUs, 304 complete and 0 interrupted iterations
default   [   1% ] 010/100 VUs  0m02.9s/4m00.0s

running (0m04.0s), 014/100 VUs, 535 complete and 0 interrupted iterations
default   [   2% ] 014/100 VUs  0m04.0s/4m00.0s

running (0m05.0s), 017/100 VUs, 828 complete and 0 interrupted iterations
default   [   2% ] 017/100 VUs  0m05.0s/4m00.0s

running (0m05.9s), 020/100 VUs, 1189 complete and 0 interrupted iterations
default   [   2% ] 020/100 VUs  0m05.9s/4m00.0s

running (0m07.0s), 023/100 VUs, 1608 complete and 0 interrupted iterations
default   [   3% ] 023/100 VUs  0m07.0s/4m00.0s

running (0m08.0s), 027/100 VUs, 2092 complete and 0 interrupted iterations
default   [   3% ] 027/100 VUs  0m08.0s/4m00.0s

running (0m09.0s), 030/100 VUs, 2648 complete and 0 interrupted iterations
default   [   4% ] 030/100 VUs  0m09.0s/4m00.0s

running (0m10.0s), 033/100 VUs, 3260 complete and 0 interrupted iterations
default   [   4% ] 033/100 VUs  0m10.0s/4m00.0s

running (0m11.0s), 037/100 VUs, 3926 complete and 0 interrupted iterations
default   [   5% ] 037/100 VUs  0m10.9s/4m00.0s

running (0m12.0s), 040/100 VUs, 4688 complete and 0 interrupted iterations
default   [   5% ] 040/100 VUs  0m11.9s/4m00.0s

running (0m12.9s), 043/100 VUs, 5481 complete and 0 interrupted iterations
default   [   5% ] 043/100 VUs  0m12.9s/4m00.0s

running (0m13.9s), 047/100 VUs, 6360 complete and 0 interrupted iterations
default   [   6% ] 047/100 VUs  0m13.9s/4m00.0s

running (0m14.9s), 050/100 VUs, 7289 complete and 0 interrupted iterations
default   [   6% ] 050/100 VUs  0m14.9s/4m00.0s

running (0m15.9s), 053/100 VUs, 8281 complete and 0 interrupted iterations
default   [   7% ] 053/100 VUs  0m15.9s/4m00.0s

running (0m16.9s), 056/100 VUs, 9247 complete and 0 interrupted iterations
default   [   7% ] 056/100 VUs  0m16.9s/4m00.0s

running (0m18.0s), 060/100 VUs, 10239 complete and 0 interrupted iterations
default   [   7% ] 060/100 VUs  0m18.0s/4m00.0s

running (0m18.9s), 063/100 VUs, 11236 complete and 0 interrupted iterations
default   [   8% ] 063/100 VUs  0m18.9s/4m00.0s

running (0m19.9s), 066/100 VUs, 12189 complete and 0 interrupted iterations
default   [   8% ] 066/100 VUs  0m19.9s/4m00.0s

running (0m21.0s), 070/100 VUs, 13189 complete and 0 interrupted iterations
default   [   9% ] 070/100 VUs  0m21.0s/4m00.0s

running (0m21.9s), 073/100 VUs, 14157 complete and 0 interrupted iterations
default   [   9% ] 073/100 VUs  0m21.9s/4m00.0s

running (0m22.9s), 076/100 VUs, 15139 complete and 0 interrupted iterations
default   [  10% ] 076/100 VUs  0m22.9s/4m00.0s

running (0m24.0s), 080/100 VUs, 16124 complete and 0 interrupted iterations
default   [  10% ] 080/100 VUs  0m23.9s/4m00.0s

running (0m24.9s), 083/100 VUs, 17089 complete and 0 interrupted iterations
default   [  10% ] 083/100 VUs  0m24.9s/4m00.0s

running (0m26.0s), 086/100 VUs, 18089 complete and 0 interrupted iterations
default   [  11% ] 086/100 VUs  0m26.0s/4m00.0s

running (0m27.0s), 089/100 VUs, 19042 complete and 0 interrupted iterations
default   [  11% ] 089/100 VUs  0m27.0s/4m00.0s

running (0m28.0s), 093/100 VUs, 20039 complete and 0 interrupted iterations
default   [  12% ] 093/100 VUs  0m28.0s/4m00.0s

running (0m28.9s), 096/100 VUs, 21035 complete and 0 interrupted iterations
default   [  12% ] 096/100 VUs  0m28.9s/4m00.0s

running (0m30.0s), 099/100 VUs, 21989 complete and 0 interrupted iterations
default   [  12% ] 099/100 VUs  0m30.0s/4m00.0s

running (0m31.0s), 100/100 VUs, 22989 complete and 0 interrupted iterations
default   [  13% ] 100/100 VUs  0m31.0s/4m00.0s

running (0m31.9s), 100/100 VUs, 23939 complete and 0 interrupted iterations
default   [  13% ] 100/100 VUs  0m31.9s/4m00.0s

running (0m32.9s), 100/100 VUs, 24939 complete and 0 interrupted iterations
default   [  14% ] 100/100 VUs  0m32.9s/4m00.0s

running (0m33.9s), 100/100 VUs, 25917 complete and 0 interrupted iterations
default   [  14% ] 100/100 VUs  0m33.9s/4m00.0s

running (0m35.0s), 100/100 VUs, 26889 complete and 0 interrupted iterations
default   [  15% ] 100/100 VUs  0m35.0s/4m00.0s

running (0m36.0s), 100/100 VUs, 27889 complete and 0 interrupted iterations
default   [  15% ] 100/100 VUs  0m36.0s/4m00.0s

running (0m37.0s), 100/100 VUs, 28839 complete and 0 interrupted iterations
default   [  15% ] 100/100 VUs  0m36.9s/4m00.0s

running (0m37.9s), 100/100 VUs, 29839 complete and 0 interrupted iterations
default   [  16% ] 100/100 VUs  0m37.9s/4m00.0s

running (0m38.9s), 100/100 VUs, 30806 complete and 0 interrupted iterations
default   [  16% ] 100/100 VUs  0m38.9s/4m00.0s

running (0m40.0s), 100/100 VUs, 31789 complete and 0 interrupted iterations
default   [  17% ] 100/100 VUs  0m40.0s/4m00.0s

running (0m41.0s), 100/100 VUs, 32789 complete and 0 interrupted iterations
default   [  17% ] 100/100 VUs  0m41.0s/4m00.0s

running (0m42.0s), 100/100 VUs, 33739 complete and 0 interrupted iterations
default   [  17% ] 100/100 VUs  0m42.0s/4m00.0s

running (0m42.9s), 100/100 VUs, 34739 complete and 0 interrupted iterations
default   [  18% ] 100/100 VUs  0m42.9s/4m00.0s

running (0m43.9s), 100/100 VUs, 35710 complete and 0 interrupted iterations
default   [  18% ] 100/100 VUs  0m43.9s/4m00.0s

running (0m44.9s), 100/100 VUs, 36689 complete and 0 interrupted iterations
default   [  19% ] 100/100 VUs  0m44.9s/4m00.0s

running (0m46.0s), 100/100 VUs, 37689 complete and 0 interrupted iterations
default   [  19% ] 100/100 VUs  0m46.0s/4m00.0s

running (0m46.9s), 100/100 VUs, 38639 complete and 0 interrupted iterations
default   [  20% ] 100/100 VUs  0m46.9s/4m00.0s

running (0m47.9s), 100/100 VUs, 39639 complete and 0 interrupted iterations
default   [  20% ] 100/100 VUs  0m47.9s/4m00.0s

running (0m49.0s), 100/100 VUs, 40620 complete and 0 interrupted iterations
default   [  20% ] 100/100 VUs  0m48.9s/4m00.0s

running (0m50.0s), 100/100 VUs, 41589 complete and 0 interrupted iterations
default   [  21% ] 100/100 VUs  0m50.0s/4m00.0s

running (0m51.0s), 100/100 VUs, 42589 complete and 0 interrupted iterations
default   [  21% ] 100/100 VUs  0m51.0s/4m00.0s

running (0m52.0s), 100/100 VUs, 43539 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m52.0s/4m00.0s

running (0m53.0s), 100/100 VUs, 44539 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m53.0s/4m00.0s

running (0m53.9s), 100/100 VUs, 45504 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m53.9s/4m00.0s

running (0m54.9s), 100/100 VUs, 46489 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m54.9s/4m00.0s

running (0m56.0s), 100/100 VUs, 47489 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m56.0s/4m00.0s

running (0m56.9s), 100/100 VUs, 48439 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m56.9s/4m00.0s

running (0m57.9s), 100/100 VUs, 49439 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m57.9s/4m00.0s

running (0m59.0s), 100/100 VUs, 50389 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  0m59.0s/4m00.0s

running (1m00.0s), 100/100 VUs, 51389 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  0m59.9s/4m00.0s

running (1m00.9s), 100/100 VUs, 52359 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  1m00.9s/4m00.0s

running (1m01.9s), 100/100 VUs, 53339 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  1m01.9s/4m00.0s

running (1m03.0s), 100/100 VUs, 54339 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  1m03.0s/4m00.0s

running (1m04.0s), 100/100 VUs, 55289 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  1m04.0s/4m00.0s

running (1m05.0s), 100/100 VUs, 56289 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  1m05.0s/4m00.0s

running (1m05.9s), 100/100 VUs, 57266 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  1m05.9s/4m00.0s

running (1m06.9s), 100/100 VUs, 58239 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  1m06.9s/4m00.0s

running (1m08.0s), 100/100 VUs, 59239 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  1m08.0s/4m00.0s

running (1m09.0s), 100/100 VUs, 60189 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  1m09.0s/4m00.0s

running (1m10.0s), 100/100 VUs, 61189 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  1m09.9s/4m00.0s

running (1m11.0s), 100/100 VUs, 62154 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  1m11.0s/4m00.0s

running (1m12.0s), 100/100 VUs, 63139 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  1m12.0s/4m00.0s

running (1m13.0s), 100/100 VUs, 64139 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  1m13.0s/4m00.0s

running (1m14.0s), 100/100 VUs, 65089 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  1m14.0s/4m00.0s

running (1m15.0s), 100/100 VUs, 66089 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  1m15.0s/4m00.0s

running (1m15.9s), 100/100 VUs, 67039 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  1m15.9s/4m00.0s

running (1m17.0s), 100/100 VUs, 68039 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  1m17.0s/4m00.0s

running (1m18.0s), 100/100 VUs, 69039 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  1m18.0s/4m00.0s

running (1m19.0s), 100/100 VUs, 69989 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  1m19.0s/4m00.0s

running (1m20.0s), 100/100 VUs, 70989 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  1m20.0s/4m00.0s

running (1m21.0s), 100/100 VUs, 71939 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  1m21.0s/4m00.0s

running (1m22.0s), 100/100 VUs, 72939 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  1m21.9s/4m00.0s

running (1m22.9s), 100/100 VUs, 73901 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  1m22.9s/4m00.0s

running (1m24.0s), 100/100 VUs, 74889 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  1m24.0s/4m00.0s

running (1m24.9s), 100/100 VUs, 75889 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  1m24.9s/4m00.0s

running (1m25.9s), 100/100 VUs, 76839 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  1m25.9s/4m00.0s

running (1m27.0s), 100/100 VUs, 77839 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  1m27.0s/4m00.0s

running (1m27.9s), 100/100 VUs, 78789 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  1m27.9s/4m00.0s

running (1m29.0s), 100/100 VUs, 79789 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  1m29.0s/4m00.0s

running (1m30.0s), 100/100 VUs, 80789 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  1m30.0s/4m00.0s

running (1m31.0s), 100/100 VUs, 81739 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  1m31.0s/4m00.0s

running (1m32.0s), 100/100 VUs, 82739 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  1m31.9s/4m00.0s

running (1m33.0s), 100/100 VUs, 83689 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  1m33.0s/4m00.0s

running (1m33.9s), 100/100 VUs, 84689 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  1m33.9s/4m00.0s

running (1m35.0s), 100/100 VUs, 85667 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m35.0s/4m00.0s

running (1m36.0s), 100/100 VUs, 86639 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m36.0s/4m00.0s

running (1m36.9s), 100/100 VUs, 87631 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m36.9s/4m00.0s

running (1m38.0s), 100/100 VUs, 88589 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m38.0s/4m00.0s

running (1m38.9s), 100/100 VUs, 89589 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m38.9s/4m00.0s

running (1m40.0s), 100/100 VUs, 90577 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m40.0s/4m00.0s

running (1m41.0s), 100/100 VUs, 91539 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m41.0s/4m00.0s

running (1m42.0s), 100/100 VUs, 92539 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m42.0s/4m00.0s

running (1m43.0s), 100/100 VUs, 93489 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m43.0s/4m00.0s

running (1m44.0s), 100/100 VUs, 94489 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m44.0s/4m00.0s

running (1m44.9s), 100/100 VUs, 95439 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m44.9s/4m00.0s

running (1m46.0s), 100/100 VUs, 96439 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m46.0s/4m00.0s

running (1m46.9s), 100/100 VUs, 97423 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m46.9s/4m00.0s

running (1m47.9s), 100/100 VUs, 98389 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m47.9s/4m00.0s

running (1m49.0s), 100/100 VUs, 99389 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m48.9s/4m00.0s

running (1m49.9s), 100/100 VUs, 100339 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m49.9s/4m00.0s

running (1m51.0s), 100/100 VUs, 101339 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m51.0s/4m00.0s

running (1m52.0s), 100/100 VUs, 102336 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m52.0s/4m00.0s

running (1m53.0s), 100/100 VUs, 103289 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m53.0s/4m00.0s

running (1m54.0s), 100/100 VUs, 104278 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m54.0s/4m00.0s

running (1m55.0s), 100/100 VUs, 105239 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m55.0s/4m00.0s

running (1m56.0s), 100/100 VUs, 106239 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m56.0s/4m00.0s

running (1m57.0s), 100/100 VUs, 107189 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m57.0s/4m00.0s

running (1m57.9s), 100/100 VUs, 108189 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m57.9s/4m00.0s

running (1m58.9s), 100/100 VUs, 109156 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m58.9s/4m00.0s

running (2m00.0s), 100/100 VUs, 110139 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  2m00.0s/4m00.0s

running (2m01.0s), 100/100 VUs, 111139 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  2m01.0s/4m00.0s

running (2m02.0s), 100/100 VUs, 112089 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  2m02.0s/4m00.0s

running (2m03.0s), 100/100 VUs, 113089 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  2m03.0s/4m00.0s

running (2m03.9s), 100/100 VUs, 114039 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  2m03.9s/4m00.0s

running (2m04.9s), 100/100 VUs, 115039 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  2m04.9s/4m00.0s

running (2m06.0s), 100/100 VUs, 116031 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  2m06.0s/4m00.0s

running (2m06.9s), 100/100 VUs, 116989 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  2m06.9s/4m00.0s

running (2m07.9s), 100/100 VUs, 117989 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  2m07.9s/4m00.0s

running (2m08.9s), 100/100 VUs, 118939 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  2m08.9s/4m00.0s

running (2m10.0s), 100/100 VUs, 119939 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  2m10.0s/4m00.0s

running (2m11.0s), 100/100 VUs, 120920 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  2m11.0s/4m00.0s

running (2m11.9s), 100/100 VUs, 121889 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  2m11.9s/4m00.0s

running (2m12.9s), 100/100 VUs, 122889 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  2m12.9s/4m00.0s

running (2m14.0s), 100/100 VUs, 123839 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  2m14.0s/4m00.0s

running (2m15.0s), 100/100 VUs, 124839 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  2m15.0s/4m00.0s

running (2m16.0s), 100/100 VUs, 125801 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  2m16.0s/4m00.0s

running (2m17.0s), 100/100 VUs, 126789 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  2m17.0s/4m00.0s

running (2m17.9s), 100/100 VUs, 127789 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  2m17.9s/4m00.0s

running (2m19.0s), 100/100 VUs, 128739 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  2m19.0s/4m00.0s

running (2m20.0s), 100/100 VUs, 129739 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  2m19.9s/4m00.0s

running (2m20.9s), 100/100 VUs, 130689 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  2m20.9s/4m00.0s

running (2m22.0s), 100/100 VUs, 131689 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  2m22.0s/4m00.0s

running (2m22.9s), 100/100 VUs, 132673 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m22.9s/4m00.0s

running (2m23.9s), 100/100 VUs, 133639 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m23.9s/4m00.0s

running (2m25.0s), 100/100 VUs, 134639 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m25.0s/4m00.0s

running (2m26.0s), 100/100 VUs, 135589 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  2m26.0s/4m00.0s

running (2m27.0s), 100/100 VUs, 136589 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  2m27.0s/4m00.0s

running (2m27.9s), 100/100 VUs, 137555 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m27.9s/4m00.0s

running (2m28.9s), 100/100 VUs, 138539 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m28.9s/4m00.0s

running (2m29.9s), 100/100 VUs, 139538 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m29.9s/4m00.0s

running (2m30.9s), 100/100 VUs, 140489 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  2m30.9s/4m00.0s

running (2m31.9s), 100/100 VUs, 141489 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  2m31.9s/4m00.0s

running (2m32.9s), 100/100 VUs, 142443 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  2m32.9s/4m00.0s

running (2m34.0s), 100/100 VUs, 143439 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  2m34.0s/4m00.0s

running (2m34.9s), 100/100 VUs, 144430 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m34.9s/4m00.0s

running (2m35.9s), 100/100 VUs, 145389 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m35.9s/4m00.0s

running (2m37.0s), 100/100 VUs, 146389 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m37.0s/4m00.0s

running (2m38.0s), 100/100 VUs, 147339 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  2m38.0s/4m00.0s

running (2m39.0s), 100/100 VUs, 148339 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  2m39.0s/4m00.0s

running (2m39.9s), 100/100 VUs, 149306 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m39.9s/4m00.0s

running (2m41.0s), 100/100 VUs, 150289 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m41.0s/4m00.0s

running (2m41.9s), 100/100 VUs, 151272 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m41.9s/4m00.0s

running (2m43.0s), 100/100 VUs, 152239 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m43.0s/4m00.0s

running (2m44.0s), 100/100 VUs, 153239 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m44.0s/4m00.0s

running (2m45.0s), 100/100 VUs, 154191 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m44.9s/4m00.0s

running (2m46.0s), 100/100 VUs, 155189 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m45.9s/4m00.0s

running (2m47.0s), 100/100 VUs, 156183 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m47.0s/4m00.0s

running (2m48.0s), 100/100 VUs, 157139 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m48.0s/4m00.0s

running (2m48.9s), 100/100 VUs, 158139 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m48.9s/4m00.0s

running (2m50.0s), 100/100 VUs, 159089 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m50.0s/4m00.0s

running (2m51.0s), 100/100 VUs, 160089 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m51.0s/4m00.0s

running (2m51.9s), 100/100 VUs, 161062 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m51.9s/4m00.0s

running (2m53.0s), 100/100 VUs, 162039 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m53.0s/4m00.0s

running (2m54.0s), 100/100 VUs, 163039 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m54.0s/4m00.0s

running (2m55.0s), 100/100 VUs, 163989 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m55.0s/4m00.0s

running (2m56.0s), 100/100 VUs, 164989 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m56.0s/4m00.0s

running (2m56.9s), 100/100 VUs, 165943 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m56.9s/4m00.0s

running (2m58.0s), 100/100 VUs, 166939 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m58.0s/4m00.0s

running (2m58.9s), 100/100 VUs, 167931 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m58.9s/4m00.0s

running (3m00.0s), 100/100 VUs, 168889 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  3m00.0s/4m00.0s

running (3m01.0s), 100/100 VUs, 169889 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  3m01.0s/4m00.0s

running (3m02.0s), 100/100 VUs, 170839 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  3m02.0s/4m00.0s

running (3m03.0s), 100/100 VUs, 171839 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  3m03.0s/4m00.0s

running (3m04.0s), 100/100 VUs, 172839 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  3m04.0s/4m00.0s

running (3m04.9s), 100/100 VUs, 173789 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  3m04.9s/4m00.0s

running (3m06.0s), 100/100 VUs, 174789 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  3m06.0s/4m00.0s

running (3m07.0s), 100/100 VUs, 175739 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  3m07.0s/4m00.0s

running (3m08.0s), 100/100 VUs, 176739 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  3m08.0s/4m00.0s

running (3m08.9s), 100/100 VUs, 177691 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  3m08.9s/4m00.0s

running (3m10.0s), 100/100 VUs, 178689 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  3m10.0s/4m00.0s

running (3m10.9s), 100/100 VUs, 179682 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  3m10.9s/4m00.0s

running (3m12.0s), 100/100 VUs, 180639 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  3m12.0s/4m00.0s

running (3m13.0s), 100/100 VUs, 181639 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  3m13.0s/4m00.0s

running (3m14.0s), 100/100 VUs, 182589 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  3m14.0s/4m00.0s

running (3m15.0s), 100/100 VUs, 183589 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  3m15.0s/4m00.0s

running (3m15.9s), 100/100 VUs, 184554 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  3m15.9s/4m00.0s

running (3m17.0s), 100/100 VUs, 185539 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  3m17.0s/4m00.0s

running (3m18.0s), 100/100 VUs, 186539 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  3m18.0s/4m00.0s

running (3m18.9s), 100/100 VUs, 187489 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  3m18.9s/4m00.0s

running (3m20.0s), 100/100 VUs, 188489 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  3m20.0s/4m00.0s

running (3m20.9s), 100/100 VUs, 189454 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  3m20.9s/4m00.0s

running (3m22.0s), 100/100 VUs, 190439 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  3m22.0s/4m00.0s

running (3m23.0s), 100/100 VUs, 191439 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  3m23.0s/4m00.0s

running (3m23.9s), 100/100 VUs, 192389 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  3m23.9s/4m00.0s

running (3m25.0s), 100/100 VUs, 193389 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  3m25.0s/4m00.0s

running (3m25.9s), 100/100 VUs, 194339 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  3m25.9s/4m00.0s

running (3m27.0s), 100/100 VUs, 195339 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  3m27.0s/4m00.0s

running (3m28.0s), 100/100 VUs, 196339 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  3m28.0s/4m00.0s

running (3m29.0s), 100/100 VUs, 197289 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  3m29.0s/4m00.0s

running (3m30.0s), 100/100 VUs, 198289 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  3m30.0s/4m00.0s

running (3m31.0s), 097/100 VUs, 199239 complete and 0 interrupted iterations
default   [  88% ] 097/100 VUs  3m31.0s/4m00.0s

running (3m32.0s), 094/100 VUs, 200239 complete and 0 interrupted iterations
default   [  88% ] 094/100 VUs  3m32.0s/4m00.0s

running (3m33.0s), 091/100 VUs, 201218 complete and 0 interrupted iterations
default   [  89% ] 091/100 VUs  3m33.0s/4m00.0s

running (3m33.9s), 087/100 VUs, 202189 complete and 0 interrupted iterations
default   [  89% ] 087/100 VUs  3m33.9s/4m00.0s

running (3m35.0s), 084/100 VUs, 203189 complete and 0 interrupted iterations
default   [  90% ] 084/100 VUs  3m35.0s/4m00.0s

running (3m36.0s), 081/100 VUs, 204139 complete and 0 interrupted iterations
default   [  90% ] 081/100 VUs  3m36.0s/4m00.0s

running (3m37.0s), 077/100 VUs, 205139 complete and 0 interrupted iterations
default   [  90% ] 077/100 VUs  3m37.0s/4m00.0s

running (3m37.9s), 074/100 VUs, 206111 complete and 0 interrupted iterations
default   [  91% ] 074/100 VUs  3m37.9s/4m00.0s

running (3m39.0s), 071/100 VUs, 207089 complete and 0 interrupted iterations
default   [  91% ] 071/100 VUs  3m39.0s/4m00.0s

running (3m39.9s), 068/100 VUs, 208089 complete and 0 interrupted iterations
default   [  92% ] 068/100 VUs  3m39.9s/4m00.0s

running (3m40.9s), 064/100 VUs, 209039 complete and 0 interrupted iterations
default   [  92% ] 064/100 VUs  3m40.9s/4m00.0s

running (3m42.0s), 061/100 VUs, 210039 complete and 0 interrupted iterations
default   [  92% ] 061/100 VUs  3m42.0s/4m00.0s

running (3m42.9s), 057/100 VUs, 211003 complete and 0 interrupted iterations
default   [  93% ] 057/100 VUs  3m42.9s/4m00.0s

running (3m44.0s), 054/100 VUs, 211989 complete and 0 interrupted iterations
default   [  93% ] 054/100 VUs  3m44.0s/4m00.0s

running (3m45.0s), 051/100 VUs, 212981 complete and 0 interrupted iterations
default   [  94% ] 051/100 VUs  3m45.0s/4m00.0s

running (3m46.0s), 047/100 VUs, 213921 complete and 0 interrupted iterations
default   [  94% ] 047/100 VUs  3m46.0s/4m00.0s

running (3m47.0s), 044/100 VUs, 214792 complete and 0 interrupted iterations
default   [  95% ] 044/100 VUs  3m46.9s/4m00.0s

running (3m48.0s), 041/100 VUs, 215642 complete and 0 interrupted iterations
default   [  95% ] 041/100 VUs  3m48.0s/4m00.0s

running (3m49.0s), 037/100 VUs, 216386 complete and 0 interrupted iterations
default   [  95% ] 037/100 VUs  3m49.0s/4m00.0s

running (3m49.9s), 034/100 VUs, 217066 complete and 0 interrupted iterations
default   [  96% ] 034/100 VUs  3m49.9s/4m00.0s

running (3m51.0s), 031/100 VUs, 217685 complete and 0 interrupted iterations
default   [  96% ] 031/100 VUs  3m50.9s/4m00.0s

running (3m52.0s), 027/100 VUs, 218269 complete and 0 interrupted iterations
default   [  97% ] 027/100 VUs  3m52.0s/4m00.0s

running (3m52.9s), 024/100 VUs, 218759 complete and 0 interrupted iterations
default   [  97% ] 024/100 VUs  3m52.9s/4m00.0s

running (3m54.0s), 021/100 VUs, 219187 complete and 0 interrupted iterations
default   [  97% ] 021/100 VUs  3m54.0s/4m00.0s

running (3m54.9s), 017/100 VUs, 219571 complete and 0 interrupted iterations
default   [  98% ] 017/100 VUs  3m54.9s/4m00.0s

running (3m56.0s), 014/100 VUs, 219870 complete and 0 interrupted iterations
default   [  98% ] 014/100 VUs  3m56.0s/4m00.0s

running (3m56.9s), 011/100 VUs, 220108 complete and 0 interrupted iterations
default   [  99% ] 011/100 VUs  3m56.9s/4m00.0s

running (3m57.9s), 007/100 VUs, 220292 complete and 0 interrupted iterations
default   [  99% ] 007/100 VUs  3m57.9s/4m00.0s

running (3m58.9s), 004/100 VUs, 220401 complete and 0 interrupted iterations
default   [ 100% ] 004/100 VUs  3m58.9s/4m00.0s

running (3m59.9s), 001/100 VUs, 220449 complete and 0 interrupted iterations
default   [ 100% ] 001/100 VUs  3m59.9s/4m00.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<5000' p(95)=102.85ms
    ✓ 'p(99)<10000' p(99)=106.87ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 881804  3673.948051/s
    checks_succeeded...: 100.00% 881804 out of 881804
    checks_failed......: 0.00%   0 out of 881804

    ✓ status is 200
    ✓ content-type is json
    ✓ workloadType is IO-BOUND
    ✓ executionTimeMs exists

    CUSTOM
    response_time_ms...............: min=50.781139 avg=95.194029 med=101.788819 max=119.097968 p(90)=102.493194 p(95)=102.857109 p(99)=106.872755
    successful_requests............: 220451 918.487013/s

    HTTP
    http_req_duration..............: min=50.78ms   avg=95.19ms   med=101.78ms   max=119.09ms   p(90)=102.49ms   p(95)=102.85ms   p(99)=106.87ms  
      { expected_response:true }...: min=50.78ms   avg=95.19ms   med=101.78ms   max=119.09ms   p(90)=102.49ms   p(95)=102.85ms   p(99)=106.87ms  
    http_req_failed................: 0.00%  0 out of 220451
    http_reqs......................: 220451 918.487013/s

    EXECUTION
    iteration_duration.............: min=50.88ms   avg=95.33ms   med=101.92ms   max=119.23ms   p(90)=102.63ms   p(95)=102.99ms   p(99)=107.06ms  
    iterations.....................: 220451 918.487013/s
    vus............................: 1      min=1           max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 49 MB  203 kB/s
    data_sent......................: 17 MB  73 kB/s



running (4m00.0s), 000/100 VUs, 220451 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  4m0s